
op_questions = [
    {
        "text": "Дії при настанні випадку травматизму?",
        "options": [
            ("Оцінити ситуацію, надати домедичну допомогу, сповістити працівника", True),
            ("Продовжити роботу і ігнорувати", False),
            ("Не повідомляти нікого", False)
        ]
    },
    {
        "text": "Яку назву потрібно вказати при оформленні лікарняного?",
        "options": [
            ("ТОВ «АС МАНУФАКТУРИНГ»", True),
            ("ТОВ «АС Мануфактуринг»", False),
            ("ТОВ «AJAX»", False),
            ("ТОВ «Ajax»", False)
        ]
    },
    {
        "text": "Гасити вогнегасниками можна електрообладнання яке під напругою?",
        "options": [
            ("Водяним", False),
            ("Вуглекислотним", True),
            ("Порошковим", True)
        ]
    },
    {
        "text": "Як безпечно вивільнити людину від дії струму?",
        "options": [
            ("Знеструмити ділянку", True),
            ("Потягнути за руку", False),
            ("Покликати іншу людину", False)
        ]
    },
    {
        "text": "З яких розділів складається посадова інструкція?",
        "options": [
            ("Обов’язки", True),
            ("Права", True),
            ("Кваліфікаційні вимоги", True),
            ("Відповідальність", True),
            ("Правила", False)
        ]
    },
    {
        "text": "Куди рухатись при екстрених ситуаціях?",
        "options": [
            ("До евакуаційного виходу та йти до місця збору", True),
            ("Йти до місця збору", False),
            ("Бігти у протилежний бік, щоб її потушити", False)
        ]
    },
    {
        "text": "Чому важливо оцінити ситуацію, а потім діяти?",
        "options": [
            ("Я можу зашкодити своїми діями", True),
            ("Я не зможу допомогти", False),
            ("Так сказав СП", False)
        ]
    },
    {
        "text": "Хто має право проводити інструктажі з ОП?",
        "options": [
            ("Безпосередній керівник", True),
            ("Будь-хто", False),
            ("Тренер Напівфабрикату", False)
        ]
    },
    {
        "text": " Порядок приведення в дію вогнегасника?",
        "options": [
            ("Зірвати пломбу, витягти чеку, спрямувати розтруб, натиснути важіль", True),
            ("Натиснути кнопку", False),
            ("Взяти в руки, спрямувати в бік пожежі, натиснути важіль", False)
        ]
    },
    {
        "text": "Періодичність проведення інструктажів з ОП?",
        "options": [
            ("Не рідше одного разу на квартал", True),
            ("Раз на рік", False),
            ("Раз на місяць", False)
        ]
    },
    {
        "text": "Які вогнегасники використовують на виробництві?",
        "options": [
            ("Порошкові", True),
            ("Вуглекислотні", True),
            ("Водяні", False)
        ]
    },
    {
        "text": "Вимоги безпеки після роботи?",
        "options": [
            ("Прибрати робоче місце", True),
            ("Вимкнути обладнання", False),
            ("Незабути відсканитись", False)
        ]
    },
    {
        "text": "Які види інструктажів проводяться на робочому місці?",
        "options": [
            ("Первинний", True),
            ("Повторний", True),
            ("Цільовий", True),
            ("Позаплановий", True),
            ("Вступний", False)
        ]
    },
    {
        "text": "Алгоритм при пожежі, яку не загасити?",
        "options": [
            ("Вимкнути електрику, евакуюватись, викликати 101", True),
            ("Залишитись, щоб спробувати потушити", False),
            ("Зняти відео", False)
        ]
    },
    {
        "text": "Дії при загрозі небезпеки?",
        "options": [
            ("Припинити роботу, повідомити інших, покинути зону", True),
            ("Ігнорувати", False),
            ("Продовжити робити", False)
        ]
    },
    {
        "text": "Умови виникнення вогню?",
        "options": [
            ("Температура, кисень, горючі матеріали", True),
            ("Газ і повітря", False),
            ("Температура, бензин і сірники", False)
        ]
    },
    {
        "text": "Дії при хімічних опіках?",
        "options": [
            ("Промити водою 10 хв, викликати 103", True),
            ("Намазати кремом (Пантенол)", False),
            ("Чекати, що буде далі", False)
        ]
    },
    {
        "text": "Що таке виробнича травма?",
        "options": [
            ("Травма або пігіршення стану здоровя", True),
            ("Яка отримана під час плавання", False),
            ("Яка отримана під час відпочинку", False)
        ]
    },
    {
        "text": "Що робити при погіршенні стану здоровя?",
        "options": [
            ("Оцінити стан, прийняти ліки, викликати 103", True),
            ("Ігнорувати і продовжувати працювати", False),
            ("Піти додому, нікому не сказавши", False)
        ]
    },
    {
        "text": "Як пересуватись сходами?",
        "options": [
            ("Наступати на кожну сходинку", True),
            ("Бігти хто швидше", False),
            ("Стрибати, або переступати через одну", False)
        ]
    },
    {
        "text": "Що з цього правильне?",
        "options": [
            ("Заборонено додавати сторонні засоби до аптечки", True),
            ("Можна все додавати", False),
            ("Аптечка не потрібна", False)
        ]
    },
    {
        "text": "Адреса заводу?",
        "options": [
            ("Вулиця Сечені 76", True),
            ("Вулиця Сечені 97", False),
            ("Вулиця Сечені 67", False)
        ]
    },
    {
        "text": "Хто відповідає за безпеку без інженера?",
        "options": [
            ("Я сам", True),
            ("Керівник", False),
            ("Старший Працівник", False)
        ]
    },
    {
        "text": "Особливість струму?",
        "options": [
            ("Не видно й не чути до контакту", True),
            ("Не видно", False),
            ("Має запах, але не видно", False)
        ]
    },
    {
        "text": "Пріоритети Ajax Systems?",
        "options": [
            ("Безпека → Якість → Кількість", True),
            ("Швидкість → Прибуток", False),
            ("Релакс→Швидкісь→Якість", False)
        ]
    },
    {
        "text": "Колега скаржиться на головний біль?",
        "options": [
            ("Відправити до медсестри або викликати 103", True),
            ("Відправити на перекур, щоб випив кави", False),
            ("Ігнорувати", False)
        ]
    },
    {
        "text": "Що робити при зауваженні з безпеки?",
        "options": [
            ("Написати Near Miss, повідомити керівника", True),
            ("Повідомити СПК", False),
            ("Сфотографувати і посміятись", False)
        ]
    }
]
op_questions += [
    {
        "text": "Перелічіть цілі працівників в Ajax Systems в порядку пріоритетності:",
        "options": [
            ("Кількісний випуск продукції, якісний випуск продукції, безпека працівників", False),
            ("Безпека працівників, якісний випуск продукції, кількісний випуск продукції", True),
            ("Кількісний випуск продукції, безпека працівників, якісний випуск продукції", False)
        ]
    },
    {
        "text": "Ваші дії при погіршенні стану здоров’я:",
        "options": [
            ("Запитати в керівника медикаменти чи викликати 103", False),
            ("Оцінити свій стан (тиск та температура), запитати в керівника медикаменти", False),
            ("Повідомити керівника та оточуючих, звернутись до медпункту", True),
            ("Прийняти власні ліки чи взяти їх з аптечки", False)
        ]
    },
    {
        "text": "Вкажіть вірний номер для виклику швидкої допомоги",
        "options": [
            ("103", True),
            ("102", False),
            ("104", False),
            ("101", False)
        ]
    }
]
general_questions = [
    {
        "text": "Який з датчиків фотографує зловмисника?",
        "options": [
            ("Leaks Protect", False),
            ("MCO", True),
            ("Mcam", True),
            ("DP", False)
        ]
    },
    {
        "text": "Чи спрацює тривога якщо зафарбувати або замаскувати лінзи MPO і MCO?",
        "options": [
            ("Так, в MCO та MPO встановлена система антимаскінг", True),
            ("Ні", False),
            ("Лише в MPO", False),
            ("Лише в MCO", False)
        ]
    },
    {
        "text": "За що відповідає департамент Debug/Repair?",
        "options": [
            ("Пакування продукції", False),
            ("Забезпечення швидкого ремонту плат та девайсів на всіх етапах виробництва", True),
            ("Контроль робочих працесів", False),
            ("Проєктування нових девайсів", False)
        ]
    },
    {
        "text": "DCO – це?",
        "options": [
            ("Внутрішній датчик руху типу штора", False),
            ("Бездротовий вуличний двонаправленний датчик руху типу штора", True),
            ("Це клавіатура", False),
            ("Це дистанційний кран перекриття води", False)
        ]
    },
    {
        "text": "Чим відрізняється WS та WSD?",
        "options": [
            ("WSD для 7–24В", True),
            ("WS для мережі 220В", True),
            ("WS має Bluetooth модем ", False),
            ("WSD працює лише по WI-FI", False)
        ]
    },
    {
        "text": "Чи реагують датчики на тварин?",
        "options": [
            ("Так, частково (до 20 кг і 50 см)", True),
            ("Ні, ніколи", False),
            ("Тільки на собак", False),
            ("Тільки вночі", False)
        ]
    },
    {
        "text": "Пристрої які ми виготовляємо, можна поділити на групи:",
        "options": [
            ("Захист від вторгнення", True),
            ("Пожежа", True),
            ("Затоплення", True),
            ("Дистанційне управління", True),
            ("Відеонагляд", True)
        ]
    },
    {
        "text": "Девайс МРР – це:",
        "options": [
            ("Датчик руху з мікрохвильовим сенсором", True),
            ("Датчик руху і розбиття скла", False),
            ("Датчик руху з фотофіксацією", False),
            ("Датчик руху з фото і відеофіксацією", False)
        ]
    },
    {
        "text": "За що відповідає департамент SMT-монтаж?",
        "options": [
            ("Візуальний контроль", False),
            ("Поверхневий монтаж SMD-компонентів за допомогою YAMAHA", True),
            ("Ремонт плат", False),
            ("Лакування плат", False)
        ]
    },
    {
        "text": "Що відбувається на дільниці внутрішньосхемного тестування?",
        "options": [
            ("Тест плат та задається прошивка", True),
            ("Поверхневий монтаж", False),
            ("Монтаж плат в корпус", False),
            ("Лакування плат", False)
        ]
    },
    {
        "text": "Чим відрізняється КРР та КР?",
        "options": [
            ("КРР має зчитувач карток tag і pass", True),
            ("КР — лише клавіатура", True),
            ("КР має дротове підключення", False),
            ("КРР має бездротове зєднання ", False)
        ]
    },
    {
        "text": "Хто такий працівник FNI?",
        "options": [
            ("Quality Technician Final Inspection", True),
            ("Старший працівник складання", False),
            ("Оператор лінії", False),
            ("Старший працівник кординатор", False)
        ]
    },
    {
        "text": "Water Stop — це:",
        "options": [
            ("Кран перекриття води з дистанційним керуванням", True),
            ("Датчик руху з дистанційним керуванням", False),
            ("Бездротова клавіатура з дистанційним керуванням", False),
            ("Датчик температури", False)
        ]
    },
    {
        "text": "З якими девайсами працює HUB HYBRID?",
        "options": [
            ("З дротовими і бездротовими", True),
            ("Тільки з дротовими", False),
            ("Лише з бездротовими", False)
        ]
    },
    {
        "text": "Чим відрізняється FP та FPP?",
        "options": [
            ("У FPP є додатковий CO сенсор", True),
            ("FP реагує на дим і температуру", True),
            ("FPP реагує лише на дим  ", False),
            ("FP є додатковий CO сенсор", False)
        ]
    }
]
general_questions += [
    {
        "text": "8 видів втрат:",
        "options": [
            ("Очікування", True),
            ("Транспортування", True),
            ("Перенесення", False),
            ("Втрата творчого потенціалу", True),
            ("Переверобництво", True),
            ("Зайві рухи", True),
            ("Надмірна обробка", True),
            ("Дефекти", True),
            ("Запаси", True)
        ]
    },
    {
        "text": "Завдяки чому відбувається пайка компонентів на селективному монтажі?",
        "options": [
            ("Селективна лінія", True),
            ("Лінія складання", False),
            ("Людини", False),
            ("Піч сушіння", False)
        ]
    },
    {
        "text": "Чи може централь працювати без електрики?",
        "options": [
            ("Так, до 15 годин", True),
            ("Ні", False),
            ("Лише 5 хв", False),
            ("Тільки 15 годин", False)
        ]
    },
    {
        "text": "Де вперше присвоюється QR-код девайсу?",
        "options": [
            ("Дільниця внутрішнього тестування", True),
            ("SMT-монтаж", False),
            ("Лінія пакування", False),
            ("На складі готової продукції", False)
        ]
    },
    {
        "text": "Чи можна налаштувати роботу датчиків за сценарієм?",
        "options": [
            ("Так, увімкнути і вимкнути", True),
            ("Ні", False),
            ("Залежить від моделі", False),
            ("Лише для камер", False)
        ]
    },
    {
        "text": "Лінійка пристроїв Ajax включає:",
        "options": [
            ("Провідні", True),
            ("Працюючі по WI-FI", False),
            ("Безпроводні", True),
            ("Працюючі по Bluetooth ", False)
        ]
    },
    {
        "text": "Яка дальність зв’язку з датчиком у HUB?",
        "options": [
            ("До 2000м", True),
            ("2000м", False),
            ("1500м", False),
            ("1850", False)
        ]
    },
    {
        "text": "Чим відрізняється DP та DPP?",
        "options": [
            ("DPP — на удари, нахили, вібрацію", True),
            ("DP має мікрофон", False),
            ("DP лише на відкриття", True),
            ("Немає різниці", False)
        ]
    },
    {
        "text": "Дільниця QC/PKG займається:",
        "options": [
            ("Перевіркою функцій", True),
            ("Візуальний контроль", True),
            ("Пакування девайсу в коробку", True),
            ("Лакуванням", False)
        ]
    },
    {
        "text": "Що таке Poka-yoke?",
        "options": [
            ("Захист від помилок", True),
            ("Зарядний пристрій", False),
            ("Назва девайсу", False),
            ("Тип акумулятора", False)
        ]
    },
    {
        "text": "Які пристрої працюють на OS Malevich?",
        "options": [
            ("Централі", True),
            ("Датчики руху", False),
            ("Ретранслятори", True),
            ("Сирени", False)
        ]
    },
    {
        "text": "Ціль ощадливого виробництва:",
        "options": [
            ("Ліквідувати втрати", True),
            ("Збільшити об'єми", False),
            ("Оптимізувати зарплати", False),
            ("Розширити площі", False)
        ]
    },
    {
        "text": "Який датчик реагує на розбиття скла?",
        "options": [
            ("Glass Protect", True),
            ("Leaks Protect", False),
            ("Combi Protect", True),
            ("Motion Protect", False)
        ]
    },
    {
        "text": "Функції FPP:",
        "options": [
            ("Повідомляє про CO", True),
            ("Повідомити про високу температуру", True),
            ("Повідомити про наявність диму", True),
            ("Повідомити про затоплення", False)
        ]
    },
    {
        "text": "Основна функція Rex/Rex2?",
        "options": [
            ("Розширення радіус дії між централью і девайсами", True),
            ("Підключення до інтернету", False),
            ("Живлення для хаба", False),
            ("Може працювати як МР", False)
        ]
    }
]
general_questions += [
    {
        "text": "Чим відрізняється MPC і DCO?",
        "options": [
            ("MPC для приміщень типу штора", True),
            ("DCO — для складу", False),
            ("MPC має камеру", False),
            ("DCO вулична типу штора ", True)
        ]
    },
    {
        "text": "Для чого потрібна стандартизація?",
        "options": [
            ("Покращення довгострокової діяльності", True),
            ("Зменшення витрат", False),
            ("Підвищення довіри до торгової марки", True),
            ("Заміна персоналу", False)
        ]
    },
    {
        "text": "Якщо датчик зірвати, чи буде повідомлення?",
        "options": [
            ("Так, через тампер", True),
            ("Ні, тільки при пошкодженні", False),
            ("Лише при втраті зв'язку", False),
            ("Ні, ніхто не дізнається", False)
        ]
    },
    {
        "text": "Датчик затоплення?",
        "options": [
            ("Leaks Protect", True),
            ("Fire Protect", False),
            ("Glass Protect", False),
            ("Motion Protect", False)
        ]
    },
    {
        "text": "Який чутливий елемент присутній у кожному датчику руху?:",
        "options": [
            ("Pir-сенсор", True),
            ("Геркон", False),
            ("Антена", False),
            ("Бузер", False)
        ]
    },
    {
        "text": "MCO це?",
        "options": [
            ("Вуличний датчик з фотофіксацією", True),
            ("Пульт дистанційного керування", False),
            ("Кран перекритя води", False),
            ("Внутрішній датчик з фотофіксацією", False)
        ]
    },
    {
        "text": "Що таке Brandplate?",
        "options": [
            ("Лицьова панель SSDD для зображення", True),
            ("Задня кришка хаба", False),
            ("Додаткова кришка для МР", False),
            ("Блок живлення до хаба", False)
        ]
    },
    {
        "text": "Чи можуть деякі датчики працювати без хабу?",
        "options": [
            ("Так, FP", True),
            ("Ні", False),
            ("Так, провідні", False),
            ("Так", False)
        ]
    },
    {
        "text": "МР — це:",
        "options": [
            ("Датчик руху, що фіксує вторгнення", True),
            ("Датчик руху з фотофіксацією", False),
            ("Датчик руху і розбиття скла", False),
            ("Датчик руху типу штора", False)
        ]
    },
    {
        "text": "Чи працює МР у темряві?",
        "options": [
            ("Так, завдяки ІЧ випромінюванню", True),
            ("Ні", False),
            ("Лише при світлові", False),
            ("Тільки вдень", False)
        ]
    },
    {
        "text": "Як приходить сповіщення про тривогу?",
        "options": [
            ("Push, SMS", True),
            ("Лише через додаток", False),
            ("По email", False),
            ("Через SMS", False)
        ]
    },
    {
        "text": "AJAX — це?",
        "options": [
            ("Компанія з розробки систем безпеки", True),
            ("Компанія охорони", False),
            ("Компанія з розробки дивайсів", False),
            ("Навчальний центр", False)
        ]
    },
    {
        "text": "СР — це:",
        "options": [
            ("Датчик руху і розбиття скла", True),
            ("Датчик руху", False),
            ("Датчик руху типу штора", False),
            ("Датчик руху з фотофіксацією", False)
        ]
    },
    {
        "text": "Різниця МРО і МСО?",
        "options": [
            ("МСО вуличний датчик руху з фотофіксацію", True),
            ("МРО вуличний датчик руху ", True),
            ("МРО внутрішній датчик руху", False),
            ("МСО внутрішній датчик руху з фотофіксацію", False)
        ]
    },
    {
        "text": "MСAM — це?",
        "options": [
            ("Внутрішній датчик руху з фотофіксацію", True),
            ("Вуличний датчик руху", False),
            ("Вуличний датчик руху з фотофіксацію", False),
            ("Внутрішній датчик руху", False)
        ]
    }
]
general_questions += [
    {
        "text": "Послідовність створення девайсу?",
        "options": [
            ("SMT → Монтаж → Напівфабрикат → Готова продукція", True),
            ("Готова продукція → SMT", False),
            ("Готова продукція → Монтаж → SMT", False),
            ("Лакування → Упаковка → Тест", False)
        ]
    },
    {
        "text": "HUB / HUB PLUS / HUB 2 / HUB 2 PLUS — це:",
        "options": [
            ("Централі системи безпеки", True),
            ("Датчики руху", False),
            ("Крани перекритя води", False),
            ("Бездротові клавіатури", False)
        ]
    },
    {
        "text": "Life Quality Sensor фіксує:",
        "options": [
            ("Температуру", True),
            ("Вологість", True),
            ("CO2", True),
            ("Рівень шуму", False)
        ]
    },
    {
        "text": "Що означає Fibra?",
        "options": [
            ("Дротове підключення", True),
            ("Бездротове підключення", False),
            ("Підключається по Wi-Fi", False),
            ("Підключається по Bluetooth", False)
        ]
    },
    {
        "text": "Який припій використовують?",
        "options": [
            ("Безсвинцевий", True),
            ("Свинцевий", False),
            ("Мідний", False),
            ("Алюмінієвий", False)
        ]
    },
    {
        "text": "Jeweller — це:",
        "options": [
            ("Радіотехнологія до 2000 м", True),
            ("Дротове підключення", False),
            ("Радіотехнологія дротових пристроїв", False),
            ("Назва центрального хабу", False)
        ]
    },
    {
        "text": "Wings — це технологія для:",
        "options": [
            ("Mcam", True),
            ("MCO", True),
            ("Mcam Fibra", True),
            ("Motion Protect", False)
        ]
    },
    {
        "text": "Fibra — це:",
        "options": [
            ("Технологія дротових пристроїв", True),
            ("Технологія бездротового сигналу", False),
            ("Тип девайсу", False)
        ]
    },
    {
        "text": "Цикл Деминга:",
        "options": [
            ("Плануй", True),
            ("Виконуй", True),
            ("Перевіряй", True),
            ("Дій", True),
            ("Утворюй", False)
        ]
    },
    {
        "text": "Після MasterBox пристрої йдуть на:",
        "options": [
            ("Склад готової продукції", True),
            ("На доопрацювання", False),
            ("На перетест", False),
            ("На переробку", False)
        ]
    },
    {
        "text": "Скільки департаментів на виробництві?",
        "options": [
            ("5", True),
            ("3", False),
            ("4", False),
            ("6", False)
        ]
    },
    {
        "text": "Відповідність ISO:",
        "options": [
            ("ISO 9001-систему менеджменту", True),
            ("ISO 14001-система екології", True),
            ("ISO 45001-охорона здоров’я", True),
            ("ISO 20022-система електричних платежів", False)
        ]
    },
    {
        "text": "Функції SC:",
        "options": [
            ("Керування охороною", True),
            ("Сигнал тривоги", True),
            ("Обладнаний бузером", False),
            ("Зчитування карт", False)
        ]
    },
    {
        "text": "Keypad Combi — це:",
        "options": [
            ("Бездротова клавіатура з карткою/брелком", True),
            ("Просто клавіатура", False),
            ("Пульт керування", False),
            ("Датчик руху", False)
        ]
    },
    {
        "text": "Завдання експериментально-технічного департаменту?",
        "options": [
            ("Масштабування процесів", True),
            ("Пайка компонентів", False),
            ("Збірка плат", False),
            ("Пошук помилок", False)
        ]
    },
    {
        "text": "Який % пристроїв проходить контроль?",
        "options": [
            ("100%", True),
            ("50%", False),
            ("10%", False),
            ("Вибірково", False)
        ]
    },
    {
        "text": "Де відбувається лакування плат?",
        "options": [
            ("Департамент монтажу", True),
            ("Департамент тестування", False),
            ("На SMT", False),
            ("На складані", False)
        ]
    },
    {
        "text": "SS — це:",
        "options": [
            ("Сирена вулична", True),
            ("Домашня сирена", False),
            ("Space Control", False),
            ("HUB", False)
        ]
    },
    {
        "text": "Канбан — це:",
        "options": [
            ("Система «точно в строк»", True),
            ("Це розрахункові листи", False),
            ("Техніка пайки", False),
            ("Програма для керування", False)
        ]
    },
    {
        "text": "Чи може HUB надсилати тривогу без інтернету?",
        "options": [
            ("Так, через SIM-карту", True),
            ("Ні, лише Wi-Fi", False),
            ("Лише через Ethernet", False),
            ("Так, через Bluetooth", False)
        ]
    },
    {
        "text": "Де зародилось Lean-виробництво?",
        "options": [
            ("Японія", True),
            ("США", False),
            ("Німеччина", False),
            ("Китай", False)
        ]
    },
    {
        "text": "Політика якості Ajax базується на:",
        "options": [
            ("Врахуванні ризиків", True),
            ("Зменшенні витрат", False),
            ("Рекламі", False),
            ("Контролі постачальника", False)
        ]
    },
    {
        "text": "Департамент якості відповідає за:",
        "options": [
            ("Проведення тестів та досліджень", True),
            ("Аналіз дефектів", True),
            ("Контроль процесів", True),
            ("Займаються вадачею халатів", False)
        ]
    },
    {
        "text": "Що таке Цінність згідно Lean?",
        "options": [
            ("Якість продукту, що важлива для клієнта", True),
            ("Кількість виробленого", False),
            ("Залучення нових працівників", False),
            ("Витрати підприємства", False)
        ]
    }
]
lean_questions = [
    {
        "text": "Що таке Втрата?",
        "options": [
            ("Будь-яка виробнича дія", False),
            ("Діяльність, яка не змінює сировину, інформацію, продукт відповідно до вимог замовника, але забирає ресурси", True),
            ("Оцінка ефективності процесу", False),
            ("Ремонт обладнання", False)
        ]
    },
    {
        "text": "Яке з наступних тверджень є правильним щодо принципу 'Система витягування' (Pull process)?",
        "options": [
            ("Продукт виготовляється партіями", False),
            ("Продукція створюється заздалегідь і зберігається", False),
            ("Виробництво базується на фактичному попиті замість прогнозів", True),
            ("Фокус лише на обсязі виробництва", False)
        ]
    },
    {
        "text": "Що можна віднести до втрати 'Дефекти'?",
        "options": [
            ("Результати аналізу", False),
            ("Поломка комплектуючої під час роботи", True),
            ("Самі дефекти", True),
            ("Технічне обслуговування", False),
            ("Всі вироби, які підлягають ремонту", True)
        ]
    },
    {
        "text": "Що таке впорядкування?",
        "options": [
            ("Процес прибирання", False),
            ("Заміна інструментів", False),
            ("Розміщення інструментів, потрібних для роботи, щоб їх легко взяти та повернути", True),
            ("Оцінка продуктивності", False)
        ]
    },
    {
        "text": "Який з наступних принципів є частиною Lean?",
        "options": [
            ("Стратегія масштабування", False),
            ("Постійне вдосконалення (кайдзен)", True),
            ("Аутсорсинг", False),
            ("Максимальне навантаження персоналу", False)
        ]
    },
    {
        "text": "Що таке Транспортування у контексті втрат?",
        "options": [
            ("Облік транспортних витрат", False),
            ("Зайве переміщення, яке не додає цінності продукту", True),
            ("Доставка товару клієнту", False),
            ("Логістичний ланцюг", False)
        ]
    },
    {
        "text": "Що таке втрата через очікування?",
        "options": [
            ("Тривалий цикл виробництва", False),
            ("Це період, протягом якого не створюється цінність внаслідок очікування на дію або рішення", True),
            ("Затримка поставки", False),
            ("Відсутність зв’язку", False)
        ]
    },
    {
        "text": "Що таке Цінність згідно з Lean?",
        "options": [
            ("Внутрішня оцінка продукції", False),
            ("Кількість витраченого часу", False),
            ("Якість продукту або послуги, що корисна для кінцевого клієнта", True),
            ("Вартість у грошовому еквіваленті", False)
        ]
    },
    {
        "text": "Які цілі має ощадливе виробництво?",
        "options": [
            ("Позбутися всіх видів втрат і ліквідувати дії, що витрачають час і ресурси", True),
            ("Підвищити обсяг виробництва", False),
            ("Зменшити кількість працівників", False)
        ]
    },
    {
        "text": "Назвіть правильну послідовність кроків інструменту 5S:",
        "options": [
            ("Стандартизація → Сортування → Впорядкування → Слідування → Чистота", False),
            ("Сортування → Впорядкування → Чистота → Стандартизація → Слідування", True),
            ("Чистота → Сортування → Слідування → Впорядкування → Стандартизація", False),
            ("Впорядкування → Сортування → Чистота → Стандартизація → Слідування", False)
        ]
    },
    {
        "text": "Що таке зайві або надлишкові рухи?",
        "options": [
            ("Робота з перервами", False),
            ("Зміна інструментів", False),
            ("Будь-який рух людей або машин, який не додає вартості товару чи послузі", True),
            ("Підвищення активності працівників", False)
        ]
    },
    {
        "text": "Що є основною проблемою, яку вирішує концепція Lean?",
        "options": [
            ("Відсутність планування", False),
            ("Неефективні процеси і надлишкові витрати", True),
            ("Проблеми з логістикою", False),
            ("Нестача персоналу", False)
        ]
    },
    {
        "text": "Які цілі має методика 5S?",
        "options": [
            ("Зменшення нещасних випадків, підвищення якості, продуктивності та прибутку", True),
            ("Підвищення бажання працювати", True),
            ("Розширення асортименту", False),
            ("Оптимізація закупівель", False)
        ]
    },
    {
        "text": "Що таке сортування?",
        "options": [
            ("Переоблік інструментів", False),
            ("Очищення від пилу", False),
            ("Перегляд всього на робочому місці з метою розділення на потрібне і непотрібне", True),
            ("Оновлення документації", False)
        ]
    },
    {
        "text": "Що таке чистота/сяяння?",
        "options": [
            ("Заміна меблів", False),
            ("Полірування деталей", False),
            ("Очищення вентиляції", False),
            ("Встановлення стандартів прибирання, щоб уникнути безладу", True)
        ]
    },
    {
        "text": "Який інструмент використовується для боротьби із втратою творчого потенціалу працівників?",
        "options": [
            ("Автоматизація процесів", False),
            ("Щомісячні звіти", False),
            ("Група в Telegram 'ЄідеЯ'", True),
            ("Планування ресурсів", False)
        ]
    },
    {
        "text": "Яка втрата є найгіршою по LEAN?",
        "options": [
            ("Перевиробництво", True),
            ("Зайві рухи", False),
            ("Очікування", False),
            ("Втрата творчого потенціалу", False)
        ]
    },
    {
        "text": "Що таке Poka Yoke в розрізі Lean?",
        "options": [
            ("Захист процесу від ненавмисних помилок", True),
            ("З японської 'дурень'", False),
            ("Інформування попередньої виробничої стадії про те, що потрібно починати роботу", False),
            ("Система методик та дій, основною ціллю яких є зменшення часу", False)
        ]
    }
]

qr_questions = [
    {
        "text": "Який правильний QR-код для DoorProtect?",
        "options": [
            ("DP – b 032 w 031", False),
            ("DP – b 011 w 012", False),
            ("DP – b 682 w 681", False),
            ("DP – w 011 b 012", True),
        ]
    },
    {
        "text": "Який правильний QR-код для FireProtect Plus?",
        "options": [
            ("FP+ – b032 w031", False),
            ("FP+ – b 031 w 032", False),
            ("FP+ – w 091 b 092", True),
            ("FP+ – b 091 w 092", False),
        ]
    },
    {
        "text": "Який правильний QR-код для ReX 2?",
        "options": [
            ("RX2 – w 461 b 462", True),
            ("RX2 – b 062 w 061", False),
            ("RX2 – b 461 w 462", False),
            ("RX2 – b 642 w 641", False),
        ]
    },
    {
        "text": "Який правильний QR-код для CombiProtect?",
        "options": [
            ("CP – w 081 b 082", True),
            ("CP – b 081 w 082", False),
            ("CP – b 022 w 021", False),
            ("CP – b 0d2 w 0d1", False),
        ]
    },
    {
        "text": "Який правильний QR-код для DPF.MBR?",
        "options": [
            ("DPF – b 682 w 681", False),
            ("DPF – b 611 w 612", False),
            ("DPF – b 642 w 641", False),
            ("DPF – w 611 b 612", True),
        ]
    },
    {
        "text": "Який правильний QR-код для HomeSiren Fibra?",
        "options": [
            ("HSF – b 751 w752", False),
            ("HSF – b 652 w 651", False),
            ("HSF – w 751 b 752", True),
            ("HSF – b 651 w 652", False),
        ]
    },
    {
        "text": "Який правильний QR-код для KeyPad?",
        "options": [
            ("KP – b 6f2 w 6f1", False),
            ("KP – b 0a1 w 0a2", False),
            ("KP – b 462 w 461", False),
            ("KP – w 0a1 b 0a2", True),
        ]
    },
    {
        "text": "Який правильний QR-код для FireProtect?",
        "options": [
            ("FP – b 092 w 091", False),
            ("FP – w 031 b 032", True),
            ("FP – b 031 w 032", False),
            ("FP – b 682 w 681", False),
        ]
    },
    {
        "text": "Який правильний QR-код для MotionCam?",
        "options": [
            ("MC – b 682 w 681", False),
            ("MC – w 0d1 b 0d2", True),
            ("MC – b 612 w 611", False),
            ("MC  – b 0d1 w 0d2", False),
        ]
    },
    {
        "text": "Який правильний QR-код для KeyPad Fibra?",
        "options": [
            ("KPF – b 0a2 w 0a1", False),
            ("KPF – b 062 w 061", False),
            ("KPF – w 6a1 b 6a2", True),
            ("KPF – b 6a1 w 6a2", False),
        ]
    },
]
qr_questions += [
    {
        "text": "Який правильний QR-код для DPPF?",
        "options": [
            ("DPPF – b 612 w 611", False),
            ("DPPF – b 0a2 w 0a1", False),
            ("DPPF – w 6f1 b 6f2", True),
            ("DPPF – b 6f1 w 6f2", False),
        ]
    },
    {
        "text": "Який правильний QR-код для GlassProtect Fibra?",
        "options": [
            ("GPF – b 1b2 w 1b1", False),
            ("GPF – w 641 b 642", True),
            ("GPF – b 682 w 681", False),
            ("GPF – b 462 w 461", False),
        ]
    },
    {
        "text": "Який правильний QR-код для StreetSiren?",
        "options": [
            ("SS – b 062 w 061", False),
            ("SS – w 142 b 141", False),
            ("SS – b 642 w 641", False),
            ("SS – w 141 b 142", True),
        ]
    },
    {
        "text": "Який правильний QR-код для StreetSiren DoubleDeck?",
        "options": [
            ("SSDD – b 1b1 w 1b2", False),
            ("SSDD – b 6d2 w 6d1", False),
            ("SSDD – b 022 w 021", False),
            ("SSDD – w 1b1 b 1b2", True),
        ]
    },
    {
        "text": "Який правильний QR-код для MotionProtect?",
        "options": [
            ("MP – b 6d2 w 6d1", False),
            ("MP – b 752 w 751", False),
            ("MP – b 012 w 011", False),
            ("MP – w 021 b 022", True),
        ]
    },
    {
        "text": "Який правильний QR-код для MotionProtect Fibra?",
        "options": [
            ("MPF – b 6d2 w 6d1", False),
            ("MPF – b 621 w 622", False),
            ("MPF – b 062 w 061", False),
            ("MPF – w 621 b 622", True),
        ]
    },
    {
        "text": "Який правильний QR-код для CombiProtect Fibra?",
        "options": [
            ("CP_F – b 062 w 061", False),
            ("CP_F – b 681 w 682", False),
            ("CP_F – b 622 w 621", False),
            ("CP_F – w 681 b 682", True),
        ]
    },
    {
        "text": "Який правильний QR-код для MotionCam Fibra?",
        "options": [
            ("MCP_F – b 642 w 641", False),
            ("MCP_F – w 6d1 b 6d2", True),
            ("MCP_F – b 012 w 011", False),
            ("MCP_F – b 082 w 081", False),
        ]
    },
    {
        "text": "Який правильний QR-код для MPC_MBR?",
        "options": [
            ("MPC – b 061 w 062", False),
            ("MPC – b 682 w 681", False),
            ("MPC – b 612 w 611", False),
            ("MPC – w 061 b 062", True),
        ]
    },
    {
        "text": "Тип QR-коду для MPO_MBR:",
        "options": [
            ("MPO – b 131 w 132", False),
            ("MPO – b 132 w 131", False),
            ("MPO – b 0d2 w 0d1", False),
            ("MPO – b немає w 131", True),
        ]
    },
]
qr_questions += [
    {
        "text": "Тип QR-коду для Transmitter:",
        "options": [
            ("TRS – b 062 w 061", False),
            ("TRS – b 622 w 621", False),
            ("TRS – b 112 w 111", False),
            ("TRS – b 112 w немає", True),
        ]
    },
    {
        "text": "Тип QR-коду для Relay:",
        "options": [
            ("RL – b 122 w немає", True),
            ("RL – b 6d2 w 6d1", False),
            ("RL – b 121 w 122", False),
            ("RL – b 122 w 121", False),
        ]
    },
    {
        "text": "Тип QR-коду для WallSwitch:",
        "options": [
            ("WS – b 1f2 w немає", True),
            ("WS – b 1f2 w 1f1", False),
            ("WS – b 082 w 081", False),
            ("WS – b 142 w 141", False),
        ]
    },
    {
        "text": "Тип QR-коду для uartBridge:",
        "options": [
            ("UART – 6- ти значний", True),
            ("UART – b 622 w 621", False),
            ("UART – b 112 w немає", False),
            ("UART – b 642 w 641", False),
        ]
    },
    {
        "text": "Тип QR-коду для MCO_MBR:",
        "options": [
            ("MCO – b 182 w 181", False),
            ("MCO – b немає w 181", True),
            ("MCO – b0d2 w0d1", False),
            ("MCO – b 181 w 182", False),
        ]
    },
    {
        "text": "Тип QR-коду для DCO_MBR:",
        "options": [
            ("DCO – b 0a2 w 0a1", False),
            ("DCO – b немає w 1a1", True),
            ("DCO – b 622 w 621", False),
            ("DCO – b 032 w 031", False),
        ]
    },
    {
        "text": "Тип QR-коду для HUB Hybrid (Fibra):",
        "options": [
            ("HUB_F – b 2800 w 1800", True),
            ("HUB_F – b 1012 w 1011", False),
            ("HUB_F – b 1800 w 2800", False),
            ("HUB_F – b 1082 w 1081", False),
        ]
    },
    {
        "text": "Який правильний QR-код для Button?",
        "options": [
            ("BTN – w 0c1 b 0c2", True),
            ("BTN – b 141 w 142", False),
            ("BTN – b 451 w 452", False),
            ("BTN – b 1600 w 2600", False),
        ]
    },
    {
        "text": "Який правильний QR-код для SpaceControl?",
        "options": [
            ("SC – b 1a00 w 2a00", False),
            ("SC – b 071 w 072", False),
            ("SC – b 141 w 142", False),
            ("SC – w 0b1 b 0b2", True),
        ]
    },
    {
        "text": "Який правильний QR-код для Double Button?",
        "options": [
            ("DB – b 191 w 192", False),
            ("DB – b 041 w 042", False),
            ("DB – w 421 b 422", True),
            ("DB – b 421 w 422", False),
        ]
    },
]
qr_questions += [
    {
        "text": "Який правильний QR-код для GlassProtect?",
        "options": [
            ("GP – b 1e1 w 1e2", False),
            ("GP – b 421 w 422", False),
            ("GP – b 1600 w 2600", False),
            ("GP – w 041 b 042", True),
        ]
    },
    {
        "text": "Який правильний QR-код для LeaksProtect?",
        "options": [
            ("LP – b 041 w 042", False),
            ("LP – b 152 w 151", False),
            ("LP – b 051 w 052", False),
            ("LP – w 051 b 052", True),
        ]
    },
    {
        "text": "Який правильний QR-код для Socket?",
        "options": [
            ("SKT – w 1e1 b 1e2", True),
            ("SKT – b 0b1 w 0b2", False),
            ("SKT – b 041 w 042", False),
            ("SKT – b 1e1 w 1e2", False),
        ]
    },
    {
        "text": "Який правильний QR-код для Keypad Combi?",
        "options": [
            ("KPC – b 0b1 w 0b2", False),
            ("KPC – b 071 w 072", False),
            ("KPC – b 041 w 042", False),
            ("KPC – w 431 b 432", True),
        ]
    },
    {
        "text": "Який правильний QR-код для VHF Bridge?",
        "options": [
            ("VHF – b 141 w 142", False),
            ("VHF – b 451 w 452", False),
            ("VHF – w 451 b 452", True),
            ("VHF – b 0b1 w 0b2", False),
        ]
    },
    {
        "text": "Який правильний QR-код для MultiTransmitter?",
        "options": [
            ("MTR – b 1200 w 2200", False),
            ("MTR – b 1c1 w 1c2", False),
            ("MTR – b 191 w 192", False),
            ("MTR – w 1c1 b 1c2", True),
        ]
    },
    {
        "text": "Який правильний QR-код для KPP.001.MBR001v12?",
        "options": [
            ("KPP – b 141 w 142", False),
            ("KPP – b 1e1 w 1e2", False),
            ("KPP – b 071 w 072", False),
            ("KPP – w 191 b 192", True),
        ]
    },
    {
        "text": "Який правильний QR-код для ReX?",
        "options": [
            ("RЕX – b 071 w 072", False),
            ("RЕX – b 461 w 462", False),
            ("RЕX – w 071 b 072", True),
            ("RЕX – b 431 w 432", False),
        ]
    },
    {
        "text": "Який правильний QR-код для HB2.MBR_4G?",
        "options": [
            ("HB2 – b 1051 w 1052", False),
            ("HB2 – b 1071 w 1072", False),
            ("HB2 – b 1600 w 2600", False),
            ("HB2 – w 1a00 b 2a00", True),
        ]
    },
]
qr_questions += [
    {
        "text": "Який правильний QR-код для HUB_07?",
        "options": [
            ("HUB07 – b 11e1 w 11e2", False),
            ("HUB07 – w 1100 b 2100", True),
            ("HUB07 – b 1a00 w 2a00", False),
            ("HUB07 – b 10b1 w 10b2", False),
        ]
    },
    {
        "text": "Який правильний QR-код для HUB2 MBR?",
        "options": [
            ("HUB2 – b 1191 w1192", False),
            ("HUB2 – b 1500 w 2500", False),
            ("HUB2 – w 1500 b 2500", True),
            ("HUB2 – b 010c1 w 010c2", False),
        ]
    },
    {
        "text": "Який правильний QR-код для HUB_Plus_MBR?",
        "options": [
            ("HUBP – b 1451 w 1452", False),
            ("HUBP – w 1200 b 2200", True),
            ("HUBP – b 01b1 w 01b2", False),
            ("HUBP – b 1a00 w 2a00", False),
        ]
    },
    {
        "text": "Який правильний QR-код для Hub 2 Plus?",
        "options": [
            ("H2P – w 1600 b 2600", True),
            ("H2P – b 1041 w 1042", False),
            ("H2P – b 1051 w 1052", False),
            ("H2P – b 1100 w 2100", False),
        ]
    },
]

